In [1]:
import numpy as np
import pandas as pd

In [36]:
df = pd.read_csv("train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [38]:
df2= pd.read_csv('test.csv')
df2.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [65]:
df2.Fare.isnull().any()

True

In [48]:
df.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [51]:
'","'.join(df.columns)

'PassengerId","Survived","Pclass","Name","Sex","Age","SibSp","Parch","Ticket","Fare","Cabin","Embarked'

In [71]:
df.Cabin.fillna('Z').map(lambda x:x[0]).value_counts()

Z    687
C     59
B     47
D     33
E     32
A     15
F     13
G      4
T      1
Name: Cabin, dtype: int64

In [77]:
def get_unique_map(s):
    m_dict = {}
    for i, v in enumerate(np.unique(s)):
        m_dict[v] = i
    return m_dict

df2.Cabin.fillna('Z').map(lambda x: x[0]).map(get_unique_map(('ABCDEFGTZ'))).head()

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: Cabin, dtype: float64

In [86]:
df2.Name #.map(lambda x: 'Mr.' in x)

0                                       Kelly, Mr. James
1                       Wilkes, Mrs. James (Ellen Needs)
2                              Myles, Mr. Thomas Francis
3                                       Wirz, Mr. Albert
4           Hirvonen, Mrs. Alexander (Helga E Lindqvist)
5                             Svensson, Mr. Johan Cervin
6                                   Connolly, Miss. Kate
7                           Caldwell, Mr. Albert Francis
8              Abrahim, Mrs. Joseph (Sophie Halaut Easu)
9                                Davies, Mr. John Samuel
10                                      Ilieff, Mr. Ylio
11                            Jones, Mr. Charles Cresson
12         Snyder, Mrs. John Pillsbury (Nelle Stevenson)
13                                  Howard, Mr. Benjamin
14     Chaffee, Mrs. Herbert Fuller (Carrie Constance...
15         del Carlo, Mrs. Sebastiano (Argenia Genovesi)
16                                     Keane, Mr. Daniel
17                                     Assaf, Mr. Gerios
18                          Ilmakangas, Miss. Ida Livija
19                 Assaf Khalil, Mrs. Mariana (Miriam")"
20                                Rothschild, Mr. Martin
21                             Olsen, Master. Artur Karl
22                  Flegenheim, Mrs. Alfred (Antoinette)
23                       Williams, Mr. Richard Norris II
24       Ryerson, Mrs. Arthur Larned (Emily Maria Borie)
25                               Robins, Mr. Alexander A
26                          Ostby, Miss. Helene Ragnhild
27                                     Daher, Mr. Shedid
28                               Brady, Mr. John Bertram
29                                     Samaan, Mr. Elias
                             ...
388                                 Canavan, Mr. Patrick
389                          Palsson, Master. Paul Folke
390                           Payne, Mr. Vivian Ponsonby
391       Lines, Mrs. Ernest H (Elizabeth Lindsey James)
392                        Abbott, Master. Eugene Joseph
393                                 Gilbert, Mr. William
394                             Kink-Heilmann, Mr. Anton
395       Smith, Mrs. Lucien Philip (Mary Eloise Hughes)
396                                 Colbert, Mr. Patrick
397    Frolicher-Stehli, Mrs. Maxmillian (Margaretha ...
398                       Larsson-Rondberg, Mr. Edvard A
399                             Conlon, Mr. Thomas Henry
400                              Bonnell, Miss. Caroline
401                                      Gale, Mr. Harry
402                       Gibson, Miss. Dorothy Winifred
403                               Carrau, Mr. Jose Pedro
404                         Frauenthal, Mr. Isaac Gerald
405         Nourney, Mr. Alfred (Baron von Drachstedt")"
406                            Ware, Mr. William Jeffery
407                           Widener, Mr. George Dunton
408                      Riordan, Miss. Johanna Hannah""
409                            Peacock, Miss. Treasteall
410                               Naughton, Miss. Hannah
411      Minahan, Mrs. William Edward (Lillian E Thorpe)
412                       Henriksson, Miss. Jenny Lovisa
413                                   Spector, Mr. Woolf
414                         Oliva y Ocana, Dona. Fermina
415                         Saether, Mr. Simon Sivertsen
416                                  Ware, Mr. Frederick
417                             Peter, Master. Michael J
Name: Name, dtype: object

In [96]:
def gettitle(x):
    import re
    r = re.compile(r'^.+?,(.+\.).+$')
    m = r.findall(x)
    if m:
        return m[0]
    return ""

print gettitle('Naughton, Miss. Hannah')
df2.Name.map(gettitle)

 Miss.

0           Mr.
1          Mrs.
2           Mr.
3           Mr.
4          Mrs.
5           Mr.
6         Miss.
7           Mr.
8          Mrs.
9           Mr.
10          Mr.
11          Mr.
12         Mrs.
13          Mr.
14         Mrs.
15         Mrs.
16          Mr.
17          Mr.
18        Miss.
19         Mrs.
20          Mr.
21      Master.
22         Mrs.
23          Mr.
24         Mrs.
25          Mr.
26        Miss.
27          Mr.
28          Mr.
29          Mr.
         ...
388         Mr.
389     Master.
390         Mr.
391        Mrs.
392     Master.
393         Mr.
394         Mr.
395        Mrs.
396         Mr.
397        Mrs.
398         Mr.
399         Mr.
400       Miss.
401         Mr.
402       Miss.
403         Mr.
404         Mr.
405         Mr.
406         Mr.
407         Mr.
408       Miss.
409       Miss.
410       Miss.
411        Mrs.
412       Miss.
413         Mr.
414       Dona.
415         Mr.
416         Mr.
417     Master.
Name: Name, dtype: object

In [95]:
r.findall('fads,fadsf.fasdf')[0]

'fadsf.'